app/controllers/v1/apple_transactions_controller.rb

  def create
    Rails.logger.info "START: #{self.class.name}"
    raise ForbiddenError.new if authenticated_user.has_role? "apple"

    subscription = T.let(Subscription.find(transaction_params[:transaction_id]), T.nilable(Subscription))
    raise SubscriptionNotFound.new(transaction_params) if subscription.nil?

    previous_transaction = subscription.transactions.order(created_at: :asc).select(
      :id,
      :action,
      :created_at,
      :currency,
      :expires_date,
      :external_id,
      :purchase_date,
      :source
    ).last
    transaction_params2 = {
      "external_id" => transaction_params[:notification_uuid],
      "action" => transaction_params[:type],
      "subscription_id" => transaction_params[:transaction_id],
      "amount" => transaction_params[:amount],
      "currency" => transaction_params[:currency],
      "purchase_date" => transaction_params[:purchase_date],
      "expires_date" => transaction_params[:expires_date],
      "source" => "apple"
    }

    already_exists = Transaction.exists?(external_id: transaction_params2["external_id"])
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = 1 LIMIT 1
SELECT "transactions"."id", "transactions"."action", "transactions"."created_at", "transactions"."currency", "transactions"."expires_date", "transactions"."external_id", "transactions"."purchase_date", "transactions"."source" FROM "transactions" WHERE "transactions"."subscription_id" = 1 ORDER BY "transactions"."created_at" DESC LIMIT 1
SELECT 1 AS one FROM "transactions" WHERE "transactions"."external_id" = '4d249252-118d-42c6-99b8-75ded060ceea' LIMIT 1


    new_transaction = Transaction.new(transaction_params2)

    if new_transaction.save
---
INSERT INTO "transactions" ("external_id", "source", "action", "amount", "currency", "purchase_date", "expires_date", "created_at", "subscription_id") VALUES ('4d249252-118d-42c6-99b8-75ded060ceea', 0, 0, 3.9, 'USD', '1990-01-01 00:01:00', '1990-02-01 12:00:00', '2026-04-04 13:21:00.691419', 1) RETURNING "id"