app/controllers/v1/authentication_controller.rb

  def login
    user_params = params.permit(:email, :password)
    user = User.where(email: params[:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'test@example.com' ORDER BY "users"."id" ASC LIMIT 1

  def register
    user_params = params.permit(
      :email,
      :password,
      :given_name,
      :family_name
    )
    user = User.new({ **user_params, roles: [] })

    if user.save
---
INSERT INTO "users" ("given_name", "family_name", "email", "password_digest", "created_at", "roles") VALUES ('example given name', 'example family name', 'test@example.com', '$2a$12$zR6tjPvXvNjd1D5tneMaSuBRsieJ2IOqgBuAUDhM2ib1XT9yeKIUO', '2026-04-04 02:18:40.116391', '[]') RETURNING "id"