app/controllers/v1/products_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "products" LIMIT 20 OFFSET 0) AS subquery_for_count
---
  def index
    offset = params[:offset].nil? ? 0 : params[:offset].to_i || 0
    limit = params[:limit].nil? ? 20 : params[:limit].to_i
    result = Product.all.offset(offset).limit(limit)
    products = T.let(result.to_a, T::Array[Product])
    count = result.count