app/controllers/v1/subscriptions_controller.rb

  def index
    offset = params[:offset].nil? ? 0 : params[:offset].to_i || 0
    limit = params[:limit].nil? ? 20 : params[:limit].to_i
    query = Subscription.where(user_id: authenticated_user.id)
    result = query.limit(limit).offset(offset)
    subscriptions = T.let(result.to_a, T::Array[Subscription])
    count = query.count
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = 1
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = 1 LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."user_id" = 1

  def show
    last_transaction = subscription.transactions.order(created_at: :asc).select(
      :id,
      :action,
      :created_at,
      :currency,
      :expires_date,
      :external_id,
      :purchase_date,
      :source
    ).last.as_json
---
SELECT "transactions"."id", "transactions"."action", "transactions"."created_at", "transactions"."currency", "transactions"."expires_date", "transactions"."external_id", "transactions"."purchase_date", "transactions"."source" FROM "transactions" WHERE "transactions"."subscription_id" = 1 ORDER BY "transactions"."created_at" DESC LIMIT 1

  def create
    new_subscription = Subscription.new({ **subscription_params, user_id: authenticated_user.id })

    if new_subscription.save
---
INSERT INTO "subscriptions" ("user_id", "product_id", "created_at") VALUES (1, 1, '2026-04-04 12:53:09.007085') RETURNING "id"

    def set_subscription
      out = Subscription.where(id: params.expect(:id)).first
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = 1 ORDER BY "subscriptions"."id" ASC LIMIT 1