app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def load_user
    payload = decode_token
    if payload
      user_id = payload[0]["data"]["id"]
      @user = User.find(user_id)